<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction

Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones.

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage.

Therefore if we can determine if the first stage will land, we can determine the cost of a launch.

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

<a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01" target="_blank">Spacex DataSet</a>

In [1]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
%load_ext sql

In [3]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [4]:
!pip install -q pandas==1.1.5

In [5]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [6]:
import pandas as pd
import numpy as np
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
print(df.columns)

Index(['Date', 'Time (UTC)', 'Booster_Version', 'Launch_Site', 'Payload',
       'PAYLOAD_MASS__KG_', 'Orbit', 'Customer', 'Mission_Outcome',
       'Landing _Outcome'],
      dtype='object')

In [7]:
#rename columns to my liking

df.rename(columns={'Date':'date'}, inplace=True)
df.rename(columns={'Time (UTC)':'time_utc'}, inplace=True)
df.rename(columns={'Booster_Version':'booster_version'}, inplace=True)
df.rename(columns={'Launch_Site':'launch_site'}, inplace=True)
df.rename(columns={'Payload':'payload'}, inplace=True)
df.rename(columns={'PAYLOAD_MASS__KG_':'payload_mass_kg'}, inplace=True)
df.rename(columns={'Orbit':'orbit'}, inplace=True)
df.rename(columns={'Customer':'customer'}, inplace=True)
df.rename(columns={'Mission_Outcome':'mission_outcome'}, inplace=True)
df.rename(columns={'Landing _Outcome':'landing_outcome'}, inplace=True)

df.insert(loc=0, column='id', value=np.arange(len(df)))
print(df.head())

df.to_sql("spacextbl", con, if_exists='replace', index=False,method="multi")

   id        date  time_utc booster_version  launch_site  \
0   0  04-06-2010  18:45:00  F9 v1.0  B0003  CCAFS LC-40
1   1  08-12-2010  15:43:00  F9 v1.0  B0004  CCAFS LC-40
2   2  22-05-2012  07:44:00  F9 v1.0  B0005  CCAFS LC-40
3   3  08-10-2012  00:35:00  F9 v1.0  B0006  CCAFS LC-40
4   4  01-03-2013  15:10:00  F9 v1.0  B0007  CCAFS LC-40

                                             payload  payload_mass_kg  \
0               Dragon Spacecraft Qualification Unit                0
1  Dragon demo flight C1, two CubeSats, barrel of...                0
2                              Dragon demo flight C2              525
3                                       SpaceX CRS-1              500
4                                       SpaceX CRS-2              677

       orbit         customer mission_outcome      landing_outcome
0        LEO           SpaceX         Success  Failure (parachute)
1  LEO (ISS)  NASA (COTS) NRO         Success  Failure (parachute)
2  LEO (ISS)      NASA (COTS)         Success           No attempt
3  LEO (ISS)       NASA (CRS)         Success           No attempt
4  LEO (ISS)       NASA (CRS)         Success           No attempt

In [8]:
%sql SELECT COUNT(*) AS total_missions FROM spacextbl;

 * sqlite:///my_data1.db
Done.

[(101,)]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
For Example "Landing_Outcome"**

### Task 1

##### Display the names of the unique launch sites  in the space mission

In [9]:
%sql SELECT DISTINCT(launch_site) FROM spacextbl;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]

### Task 2

##### Display 5 records where launch sites begin with the string 'CCA'

In [23]:
%sql SELECT * FROM spacextbl WHERE launch_site LIKE 'CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[(0, '04-06-2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 (1, '08-12-2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 (2, '22-05-2012', '07:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 (3, '08-10-2012', '00:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 (4, '01-03-2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3

##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [24]:
%sql SELECT SUM(payload_mass_kg) AS total_pl_mass_all_NASACRS FROM spacextbl WHERE customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4

##### Display average payload mass carried by booster version F9 v1.1

In [26]:
%sql SELECT AVG(payload_mass_kg) FROM spacextbl WHERE booster_version LIKE 'F9 v1.1%'

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.

*Hint:Use min function*

In [13]:
%sql SELECT MIN(id), date, landing_outcome FROM spacextbl WHERE landing_outcome = "Success (ground pad)"

 * sqlite:///my_data1.db
Done.

[(19, '22-12-2015', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [14]:
%%sql SELECT booster_version FROM spacextbl 
WHERE landing_outcome = 'Success (drone ship)' AND payload_mass_kg > 4000 AND payload_mass_kg < 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7

##### List the total number of successful and failure mission outcomes

In [15]:
%%sql 
SELECT DISTINCT(mission_outcome), COUNT(mission_outcome) AS counts
FROM spacextbl
GROUP BY mission_outcome;

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

##### Clean up results using CASE

In [16]:
%%sql
SELECT
    SUM(CASE WHEN mission_outcome LIKE 'Success%' THEN 1 else 0 END) AS overall_mission_success,
    SUM(CASE WHEN mission_outcome LIKE 'Failure%' THEN 1 else 0 END) AS overall__mission_failure,
    COUNT(*) AS total
FROM spacextbl;

 * sqlite:///my_data1.db
Done.

[(100, 1, 101)]

### Task 8

##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [17]:
%%sql SELECT DISTINCT(booster_version), payload_mass_kg 
FROM spacextbl
WHERE payload_mass_kg = (SELECT MAX(payload_mass_kg) 
FROM spacextbl)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600),
 ('F9 B5 B1049.4', 15600),
 ('F9 B5 B1051.3', 15600),
 ('F9 B5 B1056.4', 15600),
 ('F9 B5 B1048.5', 15600),
 ('F9 B5 B1051.4', 15600),
 ('F9 B5 B1049.5', 15600),
 ('F9 B5 B1060.2 ', 15600),
 ('F9 B5 B1058.3 ', 15600),
 ('F9 B5 B1051.6', 15600),
 ('F9 B5 B1060.3', 15600),
 ('F9 B5 B1049.7 ', 15600)]

### Task 9

##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.
**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

In [18]:
%%sql SELECT COUNT(mission_outcome) AS failed_mission 
    FROM spacextbl 
    WHERE mission_outcome LIKE 'Failure%' ;

 * sqlite:///my_data1.db
Done.

[(1,)]

In [19]:
%%sql SELECT id, date, landing_outcome,booster_version, launch_site
FROM spacextbl
WHERE landing_outcome = "Failure (drone ship)" AND date LIKE "%2015"
ORDER BY id

 * sqlite:///my_data1.db
Done.

[(13, '10-01-2015', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 (16, '14-04-2015', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40')]

### Task 10

##### Rank the  count of  successful landing_outcomes between the date 04-06-2010 and 20-03-2017 in descending order.

In [20]:
%%sql SELECT id, date, landing_outcome 
    FROM spacextbl
    WHERE landing_outcome LIKE "Success%"
    ORDER BY id DESC

 * sqlite:///my_data1.db
Done.

[(100, '06-12-2020', 'Success'),
 (99, '25-11-2020', 'Success'),
 (98, '21-11-2020', 'Success'),
 (97, '16-11-2020', 'Success'),
 (96, '05-11-2020', 'Success'),
 (95, '24-10-2020', 'Success'),
 (94, '18-10-2020', 'Success'),
 (93, '06-10-2020', 'Success'),
 (92, '03-09-2020', 'Success'),
 (91, '30-08-2020', 'Success'),
 (90, '18-08-2020', 'Success'),
 (89, '07-08-2020', 'Success'),
 (88, '20-07-2020', 'Success'),
 (87, '30-06-2020', 'Success'),
 (86, '13-06-2020', 'Success'),
 (85, '04-06-2020', 'Success'),
 (84, '30-05-2020', 'Success'),
 (83, '22-04-2020', 'Success'),
 (81, '07-03-2020', 'Success'),
 (79, '29-01-2020', 'Success'),
 (77, '07-01-2020', 'Success'),
 (76, '17-12-2019', 'Success'),
 (75, '05-12-2019', 'Success'),
 (74, '11-11-2019', 'Success'),
 (72, '25-07-2019', 'Success'),
 (71, '12-06-2019', 'Success'),
 (70, '24-05-2019', 'Success'),
 (69, '04-05-2019', 'Success'),
 (68, '02-03-2019', 'Success'),
 (67, '22-02-2019', 'Success'),
 (66, '11-01-2019', 'Success'),
 (63, '03-12-2018', 'Success'),
 (62, '15-11-2018', 'Success'),
 (61, '08-10-2018', 'Success'),
 (60, '10-09-2018', 'Success'),
 (59, '07-08-2018', 'Success'),
 (58, '25-07-2018', 'Success'),
 (57, '22-07-2018', 'Success'),
 (53, '11-05-2018', 'Success (drone ship)'),
 (52, '18-04-2018', 'Success (drone ship)'),
 (46, '08-01-2018', 'Success (ground pad)'),
 (44, '15-12-2017', 'Success (ground pad)'),
 (43, '30-10-2017', 'Success (drone ship)'),
 (42, '11-10-2017', 'Success (drone ship)'),
 (41, '09-10-2017', 'Success (drone ship)'),
 (40, '07-09-2017', 'Success (ground pad)'),
 (39, '24-08-2017', 'Success (drone ship)'),
 (38, '14-08-2017', 'Success (ground pad)'),
 (36, '25-06-2017', 'Success (drone ship)'),
 (35, '23-06-2017', 'Success (drone ship)'),
 (34, '03-06-2017', 'Success (ground pad)'),
 (32, '01-05-2017', 'Success (ground pad)'),
 (31, '30-03-2017', 'Success (drone ship)'),
 (29, '19-02-2017', 'Success (ground pad)'),
 (28, '14-01-2017', 'Success (drone ship)'),
 (27, '14-08-2016', 'Success (drone ship)'),
 (26, '18-07-2016', 'Success (ground pad)'),
 (24, '27-05-2016', 'Success (drone ship)'),
 (23, '06-05-2016', 'Success (drone ship)'),
 (22, '08-04-2016', 'Success (drone ship)'),
 (19, '22-12-2015', 'Success (ground pad)')]

In [21]:
%%sql SELECT date, payload, landing_outcome 
    FROM spacextbl 
    WHERE landing_outcome LIKE 'Success%' AND date > '04-06-2010' AND date < '20-03-2017';

 * sqlite:///my_data1.db
Done.

[('08-04-2016', 'SpaceX CRS-8', 'Success (drone ship)'),
 ('06-05-2016', 'JCSAT-14', 'Success (drone ship)'),
 ('18-07-2016', 'SpaceX CRS-9', 'Success (ground pad)'),
 ('14-08-2016', 'JCSAT-16', 'Success (drone ship)'),
 ('14-01-2017', 'Iridium NEXT 1', 'Success (drone ship)'),
 ('19-02-2017', 'SpaceX CRS-10', 'Success (ground pad)'),
 ('14-08-2017', 'SpaceX CRS-12', 'Success (ground pad)'),
 ('07-09-2017', 'Boeing X-37B OTV-5', 'Success (ground pad)'),
 ('09-10-2017', 'Iridium NEXT 3', 'Success (drone ship)'),
 ('11-10-2017', 'SES-11 / EchoStar 105', 'Success (drone ship)'),
 ('15-12-2017', 'SpaceX CRS-13', 'Success (ground pad)'),
 ('08-01-2018', 'Zuma', 'Success (ground pad)'),
 ('18-04-2018', 'Transiting Exoplanet Survey Satellite (TESS)', 'Success (drone ship)'),
 ('11-05-2018', 'Bangabandhu-1', 'Success (drone ship)'),
 ('07-08-2018', 'Merah Putih ', 'Success'),
 ('10-09-2018', 'Telstar 18V / Apstar-5C', 'Success'),
 ('08-10-2018', 'SAOCOM 1A', 'Success'),
 ('15-11-2018', 'Es hail 2', 'Success'),
 ('11-01-2019', 'Iridium NEXT-8', 'Success'),
 ('12-06-2019', 'RADARSAT Constellation, SpaceX CRS-18 ', 'Success'),
 ('11-11-2019', 'Starlink 1 v1.0, SpaceX CRS-19 ', 'Success'),
 ('05-12-2019', 'SpaceX CRS-19, JCSat-18 / Kacific 1 ', 'Success'),
 ('17-12-2019', 'JCSat-18 / Kacific 1, Starlink 2 v1.0 ', 'Success'),
 ('07-01-2020', 'Starlink 2 v1.0, Crew Dragon in-flight abort test ', 'Success'),
 ('07-03-2020', 'SpaceX CRS-20, Starlink 5 v1.0 ', 'Success'),
 ('04-06-2020', 'Starlink 7 v1.0, Starlink 8 v1.0', 'Success'),
 ('13-06-2020', 'Starlink 8 v1.0, SkySats-16, -17, -18, GPS III-03 ', 'Success'),
 ('07-08-2020', 'Starlink 9 v1.0, SXRS-1, Starlink 10 v1.0 ', 'Success'),
 ('18-08-2020', 'Starlink 10 v1.0, SkySat-19, -20, -21, SAOCOM 1B ', 'Success'),
 ('06-10-2020', 'Starlink 12 v1.0, Starlink 13 v1.0 ', 'Success'),
 ('18-10-2020', 'Starlink 13 v1.0, Starlink 14 v1.0 ', 'Success'),
 ('05-11-2020', 'GPS III-04 , Crew-1', 'Success'),
 ('16-11-2020', 'Crew-1, Sentinel-6 Michael Freilich ', 'Success'),
 ('06-12-2020', 'SpaceX CRS-21', 'Success')]

In [22]:
%%sql 
SELECT landing_outcome, COUNT(landing_outcome) AS Total_Landing_Outcome
FROM spacextbl
WHERE landing_outcome = 'Failure (drone ship)' OR landing_outcome = 'Success (ground pad)'
AND date BETWEEN '2010-06-04' AND '2017-03-20'
GROUP BY landing_outcome
ORDER BY Total_Landing_Outcome DESC;

 * sqlite:///my_data1.db
Done.

[('Failure (drone ship)', 5)]

### Reference Links

*   <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*   <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01&origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*   <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork26802033-2022-01-01">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log

| Date       | Version | Changed by    | Change Description        |
| ---------- | ------- | ------------- | ------------------------- |
| 2021-07-09 | 0.2     | Lakshmi Holla | Changes made in magic sql |
| 2021-05-20 | 0.1     | Lakshmi Holla | Created Initial Version   |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>